{"meta":{"title":"Kurisu","subtitle":null,"description":null,"author":"Rick Ong","url":"https://wjwrobot.github.io"},"pages":[{"title":"Projects","date":"2019-01-19T16:00:00.000Z","updated":"2019-01-20T02:13:05.250Z","comments":true,"path":"project/index.html","permalink":"https://wjwrobot.github.io/project/index.html","excerpt":"","text":"This is the project main page."},{"title":"Computer Vision","date":"2019-01-19T13:27:24.000Z","updated":"2019-01-20T02:12:39.573Z","comments":true,"path":"project/cv/index.html","permalink":"https://wjwrobot.github.io/project/cv/index.html","excerpt":"","text":"This is computer vision project."},{"title":"Auto Driver","date":"2019-01-19T13:27:24.000Z","updated":"2019-01-19T14:13:32.797Z","comments":true,"path":"project/autodriver/index.html","permalink":"https://wjwrobot.github.io/project/autodriver/index.html","excerpt":"","text":"This is auto driver project."},{"title":"Speech Recognition","date":"2019-01-19T13:27:24.000Z","updated":"2019-01-19T14:19:13.434Z","comments":true,"path":"project/nlp/index.html","permalink":"https://wjwrobot.github.io/project/nlp/index.html","excerpt":"","text":"This is speech recognition project."},{"title":"About","date":"2019-01-19T07:03:45.000Z","updated":"2019-01-21T16:00:00.000Z","comments":true,"path":"about/index.html","permalink":"https://wjwrobot.github.io/about/index.html","excerpt":"","text":"This website is for recording my life. ​ “I understand now, you are attracted to greatness. Because greatness is all in you. But it’s easier to watch greatness. It’s easier to go see greatness, than it is to put in the time, to put in the energy, to discipline yourself, to sacrifice … It’s easier, so that’s why you average. ​ You’ve been doing the same thing, you at the same job. You are experiencing the same things in your life. Nothing has changed. Everything about you is phenomenal. But you’ve consciously made a decision to be average. You are average in school, you are average at your workplace, like everything you do is average, not because it’s average, but because you made a decision. You make a choice to be average … , Why ? ​ Because the people around you are average or maybe you grew up in an average environment or went to an average school or you’ve worked for an average company. So you’ve decided. You’ve decided to go against who you are. No one else feels sorry for you, only you do. That’s the type of mindset when people aren’t successful at life. They sit there and feel sorry for themselves and they want all this fucking sympathy from everybody else. Yet they are not willing to go out there and make shit happen for themselves. Because this is not for every one. This is not for the faint at heart. This is for people who have goals and dreams, that they want to achieve. You could be great if you just showed up. ​ You deserve to see what your life would look like if you gave a 120%. You gotta run after your destiny. The choice that we have though is either to give up or keep on going. I wanna ask you – what are you going to believe. Are you gonna believe … in yourself ? Are you gonna believe everybody else’s judgement on you ? ​ I want your dream to be so clear, so vivid. That when you wake up in the morning all you have to do is step in your dream. ​ I didn’t get it till I got to this age, but I am gonna start running. I messed up junior high, but now I’m gonna start running. I messed up high school, but now I’m gonna start running. The moment you get the word – you want to run … The father said – the day you hear my voice hiding at your heart. When God gives you a chance at an escape, don’t be cute … Run after your destiny. RUN, don’t be ashamed, RUNNN. ​ The harder you work, the harder it is to surrender. And that’s in every aspect of life ​ Start acting like this is your last day on the planet. I deserve to see what my life would like if I gave a 120%. I’d rather aim for the stars and not hit them, than to not aim at all. I’d rather go after it and not get it, than not go after it at all. I’d rather try and fail, than not try at all. ​ I don’t wanna live with the idea – wonder what would’ve happen had I done more with my life. You can’t walk after your destiny. Don’t spend all your time trying to fix what’s behind you. Because you will never be able to fix what’s behind you. You have to run after what’s in front of you “ Video"}],"posts":[{"title":"Building Personal Website with Github","slug":"build_site_with_github","date":"2019-01-19T16:00:00.000Z","updated":"2019-01-20T14:30:08.355Z","comments":true,"path":"2019/01/20/build_site_with_github/","link":"","permalink":"https://wjwrobot.github.io/2019/01/20/build_site_with_github/","excerpt":"A tutorial for building your own website make use of github and hexo, with a beautiful theme “material-x”.","text":"A tutorial for building your own website make use of github and hexo, with a beautiful theme “material-x”. Install hexo​ You should alread install git and nodejs. 1$ npm install -g hexo-cli ​ Hexo create a directory for your project: 12$ hexo init &lt;folder&gt;$ cd &lt;folder&gt; ​ Hexo will build a skeleton for your site: 1$ npm install ​ Test whether everything is ok: 1$ hexo server ​ If it works well. you can change the theme, which can be found on hexo site. I will use material-x theme : 12$ cd themes$ git clone https://github.com/xaoxuu/hexo-theme-material-x themes/material-x ​ Then install dependencies: 1$ npm i -S hexo-generator-search hexo-generator-feed hexo-renderer-less hexo-autoprefixer hexo-generator-json-content hexo-recommended-posts hexo-helper-qrcode ​ Go to the your project’s root directory, and configure the file _config.yml. ​ Item theme: change its value to your theme’s name, for example: 1theme: material-x Install git deploy plugin​ Look for deploy item ,and modify it like follow: 1234deploy: type: git repo: git@github.com:wjwrobot/wjwrobot.github.io.git branch: master ​ After that we are going to install git deploy plugin: 1$ npm install hexo-deployer-git --save ​ Latsly, you can configure your theme according to this tutorial . Deploy to your github website​ Before deploy it to github, test it on local machine: 12$ hexo generator # or hexo g$ hexo server # or hexo s ​ Open a browser ,input following address: 1http://localhost:4000/ ​ If work well deploy it to github 1$ hexo deploy # or hexo d ​ Create a repo for your theme​ Change your pwd to your installed theme directory. Then use browser to create a repo and name it (e.g.hexo-theme-material-x). Change remote origin to your repo and add the origin author’s repo as remote upstream for later updating. 12345$ git remote -v$ git remote remove origin$ git remote add origin https://github.com/wjwrobot/hexo-theme-material-x.gi$ git push origin master$ git remote add upstream https://github.com/xaoxuu/hexo-theme-material-x.git ​ If upstream has update, you can use fetch command to get it and merge upstream/master to local master: 12$ git fetch upstream$ git merge upstream/master ​ Push to remote repo: 1$ git push origin master","categories":[{"name":"Web","slug":"Web","permalink":"https://wjwrobot.github.io/categories/Web/"},{"name":"Nodejs","slug":"Nodejs","permalink":"https://wjwrobot.github.io/categories/Nodejs/"}],"tags":[{"name":"git","slug":"git","permalink":"https://wjwrobot.github.io/tags/git/"},{"name":"hexo","slug":"hexo","permalink":"https://wjwrobot.github.io/tags/hexo/"},{"name":"nodejs","slug":"nodejs","permalink":"https://wjwrobot.github.io/tags/nodejs/"}]},{"title":"My New Post","slug":"My-New-Post","date":"2019-01-18T14:47:55.000Z","updated":"2019-01-20T11:35:38.332Z","comments":true,"path":"2019/01/18/My-New-Post/","link":"","permalink":"https://wjwrobot.github.io/2019/01/18/My-New-Post/","excerpt":"","text":"","categories":[{"name":"other","slug":"other","permalink":"https://wjwrobot.github.io/categories/other/"}],"tags":[{"name":"test","slug":"test","permalink":"https://wjwrobot.github.io/tags/test/"}]},{"title":"Hello World","slug":"hello-world","date":"2019-01-17T16:00:00.000Z","updated":"2019-01-19T16:00:00.000Z","comments":true,"path":"2019/01/18/hello-world/","link":"","permalink":"https://wjwrobot.github.io/2019/01/18/hello-world/","excerpt":"It is a test post.","text":"It is a test post. Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment Video","categories":[{"name":"other","slug":"other","permalink":"https://wjwrobot.github.io/categories/other/"}],"tags":[{"name":"test","slug":"test","permalink":"https://wjwrobot.github.io/tags/test/"}]}]}